[
    {
        "title": "Algorithmic Trading (RL Alpha Labs)",
        "description": "Leading the development of an AI-driven trading platform tailored for the Indian stock market, integrating advanced reinforcement learning and heuristic strategies for optimized portfolio management.",
        "bullets": [
            "Leveraged Kite-Connect API from Zerodha to build a robust historical data downloader, efficiently retrieving and storing comprehensive market data for stocks, ETFs, and other instruments in a high-performance database.",
            "Designed a custom user interface for seamless portfolio management, real-time paper trading, and algorithm-based automated execution.",
            "Engineered heuristic algorithms driven by technical signals for accurate trade simulation and backtesting.",
            "Created a versatile trading environment supporting heuristic, strategy-based, and reinforcement learning agents, with full portfolio management simulation.",
            "Implemented advanced risk management and loss tolerance systems to ensure agent stability and compliance.",
            "Developing a sophisticated reinforcement learning agent with shared learnable parameters to trade across diverse entities, including multiple stocks, markets, brokers, cryptocurrencies, equities, and commodities."
        ],
        "demonstration": "",
        "code": ""
    },
    {
        "title": "Knox Capture",
        "description": "Led the development of an innovative solution for scanning damaged barcodes on mobile devices, leveraging advanced synthetic dataset generation and cutting-edge computer vision techniques to overcome real-world challenges.",
        "bullets": [
            "Pioneered a comprehensive barcode scanning system encompassing detection, segmentation, damage correction, and decoding of compromised barcodes.",
            "Engineered a groundbreaking algorithm integrating mathematics, statistics, and geometric transformations to produce high-fidelity, photorealistic synthetic datasets, addressing the critical shortage of natural damaged barcode data.",
            "Deployed YOLOv11 for precise barcode detection in complex environments.",
            "Utilized Mask R-CNN for superior image segmentation, enabling accurate isolation of barcode regions.",
            "Implemented a U-Net-based encoder-decoder architecture for intelligent damage correction and restoration.",
            "Integrated a ResNet classifier for robust categorization of barcode types across diverse formats.",
            "Orchestrated full end-to-end deployment: from algorithmic problem formulation and probabilistic dataset synthesis incorporating reflection physics, through rigorous deep learning model training for detection, segmentation, correction, and classification, culminating in optimized on-device Android implementation with hardware-accelerated camera integration and ultra-fast ML inference capabilities.",
            "Addressed limitations of the Muenster Barcode Database, which lacks sufficient damaged barcode samples for robust training, by creating a synthetic dataset that enabled superior model performance.",
            "Benchmarking revealed that existing solutions achieved approximately 84% detection accuracy and 67% correct decoding on damaged barcodes; our innovative approach elevated these metrics to 70-75% for both detection and decoding, representing a significant leap in reliability.",
            "Introduced confidence score prediction for detections, allowing the system to intelligently assess barcode damage levels and abstain from restoration when damage exceeds recoverable thresholds, thereby drastically reducing incorrect decoding rates and enhancing overall system trustworthiness."
        ],
        "demonstration": "",
        "code": ""
    },
    {
        "title": "SRIN-Satyapan",
        "description": "Engineered a comprehensive anti-cheat proctored exam platform featuring advanced face recognition for secure candidate authentication and real-time face detection to flag potential plagiarism. Delivered a full-stack solution encompassing a web portal for examiners, a robust Android application for candidates, and a centralized server for seamless data management and AI-driven monitoring, ensuring integrity in remote assessments.",
        "bullets": [
            "Real-time face recognition-based authentication for candidates.",
            "Intelligent flagging of multiple persons or unauthorized individuals on screen, with safeguards to avoid false positives for random exam hall appearances.",
            "Detection of unfair behaviors such as talking or suspicious activities during exams.",
            "Comprehensive server-side exam portal including question uploading for examiners, result and registration portals for HRs, with question and option randomization to prevent copying.",
            "Scalable system supporting over 10,000+ registered faces with successful recognition.",
            "Auto-update features for Android apps to ensure seamless testing.",
            "Kiosk mode implementation to prevent software tampering on managed devices."
        ],
        "demonstration": "",
        "code": ""
    },
    {
        "title": "Face Recognition",
        "description": "Developed an advanced real-time multiple face recognition system for live camera feeds and offline video processing.",
        "bullets": [
            "Developed an advanced real-time multiple face recognition system for live camera feeds and offline video processing.",
            "Optimized database search efficiency from linear to logarithmic time complexity, achieving a dramatic reduction in search time from 1200ms to 87ms on Android tablets for face embedding searches.",
            "Generated a custom dataset of face embeddings and trained a proprietary classifier on this dataset to enhance recognition accuracy and surpass limitations of standard methods.",
            "Built integrated surveillance and entry management systems leveraging this technology for enhanced security and access control.",
            "Provided recognition solutions for static photos, videos, and real-time camera feeds, compatible across Android, Windows, and Linux platforms."
        ],
        "demonstration": "",
        "code": ""
    },
    {
        "title": "Distraction Detection",
        "description": "Implemented an intelligent system to monitor user attention during screen-based activities, utilizing facial expression analysis, eye movement tracking, yawn detection, head pose estimation, and robust face detection algorithms to accurately identify distracted states and promote focused engagement. This solution was deployed on Android devices and integrated into SRI-N Satyapan for enhanced proctoring capabilities.",
        "bullets": [],
        "demonstration": "",
        "code": ""
    },
    {
        "title": "Car Crash Detection",
        "description": "Created a smartphone-based emergency response system to detect car crash incidents in real-time using onboard sensors, automatically triggering SOS alerts to designated contacts for rapid assistance and improved road safety.",
        "bullets": [
            "Created a smartphone-based emergency response system to detect car crash incidents in real-time using onboard sensors, automatically triggering SOS alerts to designated contacts for rapid assistance and improved road safety.",
            "Overcame the major challenge of insufficient accident sensor data by collecting comprehensive datasets from non-accident scenarios including rash driving, phone throwing, loud music, and movies.",
            "Developed a statistical model to accurately flag potential accidents.",
            "Implemented the solution on Android phones for seamless integration."
        ],
        "demonstration": "",
        "code": ""
    },
    {
        "title": "Drop Detection",
        "description": "Achieved a groundbreaking reduction in model parameters from millions to fewer than 20, maintaining high accuracy with only a minimal drop from 98% to 96%, enabling efficient on-device deployment.",
        "bullets": [
            "Achieved a groundbreaking reduction in model parameters from millions to fewer than 20, maintaining high accuracy with only a minimal drop from 98% to 96%, enabling efficient on-device deployment.",
            "Developed a sophisticated mobile solution for detecting phone drops, estimating fall height, classifying collision surface hardness, and verifying drop versus catch events through advanced sensor fusion and predictive analytics.",
            "Replaced the existing deep learning-based solution with efficient statistical models and simple ML algorithms.",
            "Significantly improved power consumption and computational efficiency."
        ],
        "demonstration": "",
        "code": ""
    },
    {
        "title": "PacMan AI",
        "description": "AI-based intelligent agent to control Pacman in different environments. The Pacman plays against the ghosts and tries to eat all food while staying safe from ghosts and finishing in minimum time. The Pacman uses different methods like A* Search, Heuristics, Reinforcement Learning with different parameters.",
        "bullets": [],
        "demonstration": "https://inst.eecs.berkeley.edu/~cs188/sp21/project1/",
        "code": "https://github.com/stopslavery404/CS188-AI/tree/main/proj1-search-python3"
    },
    {
        "title": "Automatic Review Analyzer",
        "description": "Sentiment analysis for customer reviews using a simple perceptron algorithm.",
        "bullets": [],
        "demonstration": "",
        "code": "https://github.com/stopslavery404/Machine-Learning/tree/main/Project1/sentiment_analysis"
    },
    {
        "title": "MNIST Digit Recognition",
        "description": "Classification of digits using support vector machine and gradient descent.",
        "bullets": [],
        "demonstration": "",
        "code": "https://github.com/stopslavery404/Machine-Learning/tree/main/Project2/mnist/part1"
    },
    {
        "title": "Overlapping Digit Recognition",
        "description": "Classification of overlapping digits which contain multiple digits in a single image, where a digit is written over another digit, using Convolutional Neural Networks.",
        "bullets": [],
        "demonstration": "",
        "code": "https://github.com/stopslavery404/Machine-Learning/tree/main/Project2/mnist/part2-twodigit"
    },
    {
        "title": "Collaborative Filtering via Gaussian Mixtures",
        "description": "Recommender system for Netflix using Gaussian Mixtures models and EM algorithm. Ratings of few users for different movies are provided as input and ratings for movies which the user has not rated are calculated. It achieves very nice accuracy.",
        "bullets": [],
        "demonstration": "",
        "code": "https://github.com/stopslavery404/Machine-Learning/tree/main/project4/resources_netflix/netflix"
    },
    {
        "title": "Text game using Reinforcement Learning",
        "description": "It is a game in which a robot is given tasks in a room and learns to play it. Implementations using Q learning, Q learning with approximations, using neural networks to reduce the exponential size Q Tables.",
        "bullets": [],
        "demonstration": "",
        "code": "https://github.com/stopslavery404/Machine-Learning/tree/main/project5/rl"
    },
    {
        "title": "Maze Solver",
        "description": "Demonstration of complexity, speed, effectiveness of different search algorithms.",
        "bullets": [],
        "demonstration": "",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence"
    },
    {
        "title": "Degrees",
        "description": "Calculation of minimum degree of separation between actors in Hollywood. Separation is in terms of working together.",
        "bullets": [],
        "demonstration": "https://cs50.harvard.edu/ai/2020/projects/0/degrees/",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/degrees"
    },
    {
        "title": "Tic-Tac-Toe AI",
        "description": "Minimax and Alpha-Beta pruning based undefeatable intelligent agent to play against human.",
        "bullets": [],
        "demonstration": "https://www.youtube.com/watch?v=tp9DjqV_KoU",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/tictactoe"
    },
    {
        "title": "Minesweeper AI",
        "description": "Knowledge-based intelligent agent to play Minesweeper which reasons using propositional logic.",
        "bullets": [],
        "demonstration": "https://cs50.harvard.edu/ai/2020/projects/1/minesweeper/",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/minesweeper"
    },
    {
        "title": "CSP solver for Crossword Puzzle",
        "description": "Solves crossword puzzles by modeling it into a Constraint Satisfaction Problem and then using backtracking search with different heuristics to improve performance.",
        "bullets": [],
        "demonstration": "https://cs50.harvard.edu/ai/2020/projects/3/crossword/",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/crossword"
    },
    {
        "title": "Probabilistic models for reasoning under uncertainty",
        "description": "To demonstrate page ranking and gene inheritance, by sampling and using bayes-net.",
        "bullets": [],
        "demonstration": "https://cs50.harvard.edu/ai/2020/projects/2/",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/probabilistic%20models"
    },
    {
        "title": "Shopping",
        "description": "K Nearest Neighbour model to predict whether a customer will make the purchase or not.",
        "bullets": [],
        "demonstration": "https://cs50.harvard.edu/ai/2020/projects/4/shopping/",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/shopping"
    },
    {
        "title": "NIM",
        "description": "Playing NIM against human. Trained using reinforcement learning.",
        "bullets": [],
        "demonstration": "https://cs50.harvard.edu/ai/2020/projects/4/nim/",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/nim"
    },
    {
        "title": "Traffic Sign classification",
        "description": "CNN model for 43 class classification of traffic sign boards.",
        "bullets": [],
        "demonstration": "https://cs50.harvard.edu/ai/2020/projects/5/traffic/",
        "code": "https://github.com/stopslavery404/Artificial-Intelligence/tree/main/traffic"
    },
    {
        "title": "CS50 Wiki",
        "description": "Mini version of Wikipedia with almost all features of Wikipedia. Built using Django, HTML, Jinja, CSS, SASS.",
        "bullets": [],
        "demonstration": "https://mycs50wiki.herokuapp.com/",
        "code": ""
    },
    {
        "title": "HomePage",
        "description": "My homepage which contains details about me like hobbies, interests, and many things more. Built using Flask, HTML, CSS, JavaScript.",
        "bullets": [],
        "demonstration": "https://stopslavery404.herokuapp.com/",
        "code": ""
    },
    {
        "title": "CS50-Finance",
        "description": "A lite app to get quotes of stocks and to perform buy, sell stocks. Technologies used: Flask, SQL, APIs, JSON, Heroku, GIT.",
        "bullets": [],
        "demonstration": "https://mycs50finance.herokuapp.com/",
        "code": ""
    }
]